DiplomD/src/Documents/ЗаявленияНаПересдачу/ЗаявленияНаПересдачу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявленияНаПересдачу</name>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.СписокСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаГосударственнойИтоговойАттестации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Enums/Семестры/Семестры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Семестры</name>
  <enumValues>
    <name>Псеместр</name>
  </enumValues>
  <enumValues>
    <name>Втсеместр</name>
  </enumValues>
  <enumValues>
    <name>Трсеместр</name>
  </enumValues>
  <enumValues>
    <name>Чтсеместр</name>
  </enumValues>
  <enumValues>
    <name>ПятСеместр</name>
  </enumValues>
  <enumValues>
    <name>ШесСеместр</name>
  </enumValues>
  <enumValues>
    <name>СедСеместр</name>
  </enumValues>
  <enumValues>
    <name>ВосСеместр</name>
  </enumValues>
</mdclass:Enum>

DiplomD/src/Documents/ЗачетнаяКнижкаСтудента/ЗачетнаяКнижкаСтудента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗачетнаяКнижкаСтудента</name>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.СписокСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗачетнойКнижки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокАттестационныхДисцилин</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДисциплины</name>
      <type>
        <types>CatalogRef.ОбъемыПромежуточнойАттестации</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <types>EnumRef.ВидыОценокЗачет</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Перезачтено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийСеместровыйРейтинг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Catalogs/СписокСтудентов/СписокСтудентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СписокСтудентов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗачетнойКнижки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбразовательнаяПрограмма</name>
    <type>
      <types>CatalogRef.ОбразовательныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БаллВступительныхИспытаний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетнаяКнижка</name>
    <type>
      <types>DocumentRef.ЗачетнаяКнижкаСтудента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОбразования</name>
    <type>
      <types>CatalogRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomD/src/Catalogs/Группы/Группы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Группы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кафедра</name>
    <type>
      <types>CatalogRef.Кафедры</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбразовательнаяПрограмма</name>
    <type>
      <types>CatalogRef.ОбразовательныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОбразования</name>
    <type>
      <types>CatalogRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодНачалаОбучения</name>
    <type>
      <types>EnumRef.ГодНачалаОбучения</types>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomD/src/Catalogs/РабочаяПрограммаДисцилины/РабочаяПрограммаДисцилины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочаяПрограммаДисцилины</name>
  <tabularSections>
    <name>ТекущийКонтроль</name>
    <attributes>
      <name>ФормаОбучения</name>
      <type>
        <types>CatalogRef.ФормыОбучения</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбразовательнаяПрограмма</name>
      <type>
        <types>CatalogRef.ОбразовательныеПрограммы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрофильНаправления</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтроля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПреподавательскийСостав</name>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПромежуточнаяАттестация</name>
    <attributes>
      <name>ОбразовательнаяПрограмма</name>
      <type>
        <types>CatalogRef.ОбразовательныеПрограммы</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормаОбучения</name>
      <type>
        <types>CatalogRef.ФормыОбучения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрофильНаправления</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидПромежуточнойАттестации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аттестация</name>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбразовательнаяПрограмма</name>
      <type>
        <types>CatalogRef.ОбразовательныеПрограммы</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормаОбучения</name>
      <type>
        <types>CatalogRef.ФормыОбучения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрофильНаправления</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидАттестации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

DiplomD/src/Documents/ЗаявленияНаПересдачу/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура СоздатьДокументПересдачиНаСервере()
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	переаттестация.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.переаттестация КАК переаттестация
	               |ГДЕ
	               |	переаттестация.ЗаявлениеНаПересдачу = &ЗаявлениеНаПересдачу";
	Запрос.УстановитьПараметр("ЗаявлениеНаПересдачу",Объект.Ссылка); 
	Рез = Запрос.Выполнить().Выбрать(); 
	рез.Следующий(); 
	Если НЕ ПустаяСтрока(рез.Ссылка) Тогда 
		Сообщить("Ранее был создан документ переаттестации по данному заявлению"); 
	Иначе 
		
	Док = Документы.переаттестация.СоздатьДокумент(); 
	Док.Дата = ТекущаяДата(); 
	Док.ЗаявлениеНаПересдачу = Объект.Ссылка; 
	Спр = Справочники.СписокСтудентов.НайтиПоНаименованию(Объект.Студент);
	Группа = Справочники.Группы.НайтиПоНаименованию(Спр.Группа); 
	Док.Факультет = Группа.Факультет; 
	Док.НаправлениеПодготовки = Спр.ПрофильНаправления;  
	Док.Студент = Объект.Студент; 
	Док.НомерЗачетнойКнижки = Спр.НомерЗачетнойКнижки;  
	
	Для каждого стр из Объект.ТЧ Цикл
		О = Док.ТЧ.Добавить(); 
		О.Дисциплина = Стр.Дисциплина; 
		СпрДисц = Справочники.РабочаяПрограммаДисцилины.НайтиПоНаименованию(Стр.Дисциплина); 
		Парам = Новый Структура; 
		Парам.Вставить("Семестр",Стр.Семестр); 
		Парам.Вставить("ОбразовательнаяПрограмма",Группа.ОбразовательнаяПрограмма); 
		Парам.Вставить("ФормаОбучения",Спр.ФормаОбучения);  
		НС = СпрДисц.Аттестация.НайтиСтроки(Парам); 
		Для каждого строка из НС Цикл   
			О.КоличествоЧасов = Строка.КоличествоЧасов; 
			О.ФормаИтоговогоКонтроля = Строка.ВидАттестации; 
			
		КонецЦикла; 
		 
		
		
		
	КонецЦикла;
	Док.Семестр = Стр.Семестр; 
	   Попытка 
	 Док.Записать(РежимЗаписиДокумента.Запись); 
	 Док.Записать(РежимЗаписиДокумента.Проведение);  
	 Сообщить("Создан документ переаттестации для студента" + " " + Объект.Студент); 
 Исключение 
	 Сообщить("Документ переаттестации не создан"); 
 КонецПопытки; 
 
 КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументПересдачи(Команда)
	СоздатьДокументПересдачиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТЧДисциплинаПриИзмененииНаСервере(Дисц,Семестр,Препод,Курс)
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Семестр КАК Семестр,
	               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.КоличествоЧасов КАК КоличествоЧасов,
	               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.перезачтено КАК перезачтено,
	               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Преподаватель КАК Преподаватель
	               |ИЗ
	               |	Документ.ЗачетнаяКнижкаСтудента.СписокАттестационныхДисцилин КАК ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин
	               |ГДЕ
	               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Дисциплина = &Дисциплина
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Семестр УБЫВ";
          Запрос.УстановитьПараметр("Дисциплина",Дисц);
		  Рез = Запрос.Выполнить().Выбрать();  
		  рез.Следующий(); 
		  Препод = рез.Преподаватель;  
		  Семестр = Рез.Семестр;
		  Если Семестр = перечисления.Семестры.Псеместр ИЛИ Семестр = Перечисления.Семестры.Втсеместр Тогда 
			  Курс = 1; 
		  КонецЕсли; 
		  Если Семестр = перечисления.Семестры.Трсеместр ИЛИ Семестр = перечисления.Семестры.Чтсеместр Тогда 
			  Курс = 2; 
		  КонецЕсли; 
		  Если Семестр = перечисления.Семестры.ПятСеместр или Семестр = перечисления.Семестры.Втсеместр Тогда 
			  Курс = 3; 
		  КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧДисциплинаПриИзменении(Элемент)
	Стр = Элементы.ТЧ.ТекущиеДанные; 
	Дисц = Стр.Дисциплина; 
	Семестр = "";
	Курс = "";
	Препод = "";
	ТЧДисциплинаПриИзмененииНаСервере(Дисц,Семестр,Препод,Курс); 
	Стр.Преподаватель = Препод; 
	Стр.Семестр = Семестр;  
	Стр.Курс = Курс; 
	 
	
	
КонецПроцедуры

&НаСервере
Процедура СтудентПриИзмененииНаСервере()
	Спр = Справочники.СписокСтудентов.НайтиПоНаименованию(Объект.Студент); 
	Объект.Группа = Спр.Группа; 
КонецПроцедуры

&НаКлиенте
Процедура СтудентПриИзменении(Элемент)
	СтудентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	ТабДок = Новый ТабличныйДокумент; 
	
	Макет = Документы.ЗаявленияНаПересдачу.ПолучитьМакет("Макет"); 
	
	Шапка = Макет.ПолучитьОбласть("Шапка"); 
	Шапка.Параметры.Проректор = Константы.ПроректорПоУчебнойРаботе.Получить(); 
	Шапка.Параметры.Группа = Объект.Группа; 
	Шапка.Параметры.ФИО = Объект.Студент; 
	
	ТабДок.Вывести(Шапка); 
	Ном = 0;
	Табл = Макет.ПолучитьОбласть("табл"); 
	
	Для каждого стр из Объект.ТЧ Цикл   
		Ном= Ном +1; 
		табл.Параметры.Ном = Ном; 
		Табл.Параметры.Дисц = Стр.Дисциплина; 
		Табл.Параметры.Сем = Стр.Семестр; 
		табл.Параметры.Курс = Стр.Курс; 
		Табл.Параметры.Препод = Стр.Преподаватель; 
		
		ТабДок.Вывести(Табл); 
		
		
	КонецЦикла; 
	
	Подвал = Макет.ПолучитьОбласть("Подвал"); 
	Подвал.Параметры.Датнач = Объект.ДатаНачалаПереаттестации; 
	Подвал.Параметры.Дат = объект.Дата; 
	
	ТабДок.Вывести(Подвал); 
	
	Пробел = Макет.ПолучитьОбласть("Пробел"); 
	Табдок.Вывести(Пробел); 
	
	Подпись = Макет.ПолучитьОбласть("Подпись"); 
	
	Табдок.Вывести(Подпись);   
	
	Пробел2 = Макет.ПолучитьОбласть("Пробел2"); 
	Табдок.Вывести(Пробел2);  
	
	 Спр = Справочники.Группы.НайтиПоНаименованию(Объект.Группа); 
	 Факультет = Спр.Факультет; 
	 
	 Спр2 = Справочники.Факультеты.НайтиПоНаименованию(Факультет); 
	 
	 Подпись2 = Макет.ПолучитьОбласть("Подпись2"); 
	 
	 Подпись2.Параметры.Декан = Спр2.ДеканФакультета; 
	 
	 Табдок.Вывести(Подпись2);
	
	
	Возврат ТабДок; 
	
	
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда)

	Табдок = Новый ТабличныйДокумент; 
	Табдок = ПечатьНаСервере();
	табДок.показать(); 
КонецПроцедуры
